Money=eval(input("請輸入你的全年綜合所得IC:"))

if(Money<=300000):
    print("需繳交之所得稅為:","0","元",",","月平均可支用所得為:",Money/12,"元")

elif(Money<=540000):
    print("需繳交之所得稅為:",(Money-300000)*0.05,"元",",","月平均可支用所得為:",(Money-((Money-300000)*0.05))/12,"元")

elif(Money<=1210000):
    print("需繳交之所得稅為:",(Money-300000)*0.12,"元",",","月平均可支用所得為:",(Money-((Money-300000)*0.12))/12,"元")

elif(Money<=2420000):
    print("需繳交之所得稅為:",(Money-300000)*0.2,"元",",","月平均可支用所得為:",(Money-((Money-300000)*0.2))/12,"元")

elif(Money<=4530000):
    print("需繳交之所得稅為:",(Money-300000)*0.3,"元",",","月平均可支用所得為:",(Money-((Money-300000)*0.3))/12,"元")

elif(Money>4530000):
    print("需繳交之所得稅為:",(Money-300000)*0.4,"元",",","月平均可支用所得為:",(Money-((Money-300000)*0.4))/12,"元")
    
